---
kind: property
id: P:Autodesk.Revit.DB.Document.Settings
zh: 文档、文件
source: html/1581b3ec-eaef-9ad9-3d57-cf75a4f09b58.htm
---
# Autodesk.Revit.DB.Document.Settings Property

**中文**: 文档、文件

Provides access to general application settings, such as Categories.

## Syntax (C#)
```csharp
public Settings Settings { get; }
```

## Remarks
Returns an object that provides access to various settings within Autodesk Revit.
The Settings property returns an object that provides access to the categories within the Autodesk
Revit project.